/*
	기본 자료형 : 숫자형 , 문자열 , 불 
	
	변수/상수 : 데이터 1개 저장할수 있는 공간 						메모리(컴퓨터 = 숫자 ) 단독주택
		1. 변수 : 변하는 수 [ let ] 										식별 : 메모리 주소(번지)	16진수			
							변수이름(문자) -------> 메모리주소(16진수) 
		2. 상수 : 고정된 수 [ const ]
		
	배열 : 데이터 여러개를 저장할수 있는 공간 =   [ 값1 , 값2, 값3 ]
							배열이름(문자) -------> 메모리주소(16진수)		아파트
															메모리->메모리1->메모리2->메모리3
	
	연산자 : 1. 산술연산자 2. 비교연산자 3.논리연산자 4.대입연산자 5.증감연산자 6.삼항연산자 
	
	제어 : if
	반복 : for 		
	
	저장공간[ = 메모리 = 주기억장치 = RAM ]
	
		* 명령어[1,0] ->  명령어 -> 프로세스 -> 프로그램
	
											본체
									--------------------
										1.CPU : 명령어 제어 / 연산 / 관리 / 해독 등 
											레지스터 : 명령어들 임시 저장소
		a ------------- ---------->			10000001 번역
	키보드/마우스 ------- 입력 ------->		2.주기억장치 메모리 : 현재 실행중인 프로그램 기억[명령어]
											영구저장 X , 변수
										3.보조기억장치 SSD : 영구저장[]
											USB , C , CD , DVD , Database ,코드 
	모니터 <------------출력---------
									---------------------
*/